{
    "черный ящик": "черный ящик, Black box\nТестировщику не известно как устроена тестируемая система",
    "белый ящик": "белый ящик, White box\nТестировщику известно все детали реализации тестируемой системы",
    "серый ящик": "серый ящик, Grey box\nТестировщику известно только некоторые особенности устройства тестируемой системы",
    "спецификация": "спецификацияспецификация\nДетальное описание того, как должно работать ПО.",
    "приоритет багов": "приоритет баговприоритет багов\nВажность той или иной ошибки в ПО: \nTrivial — косметическая малозаметная проблема.\nMinor — очевидная, незначительная проблема.\nMajor — значительная проблема.\nCritical — проблема, нарушающая работу c ключевыми функциями ПО.\nBlocker — проблема, нарушающая функционирование ПО.",
    "баг репорт": "баг репорт\nДокумент, описывающий ситуацию или последовательность действий приведшую к некорректной работе объекта тестирования, с указанием причин и ожидаемого результата",
    "валидация": "валидация\nОпределение соответствия разрабатываемого ПО ожиданиям и потребностям пользователя, требованиям к системе",
    "верификация": "верификация\nПроцесс оценки системы или её компонентов с целью определения удовлетворяют ли результаты текущего этапа разработки условиям, сформированным в начале этого этапа",
    "тестирование": "тестирование\nПроцесс проверки соответствия заявленных к продукту требований и реально реализованной функциональности, осуществляемый путем наблюдения за его работой в искусственно созданных ситуациях и на ограниченном наборе тестов, выбранных определенным образом",
    "qa": "qa\nСовокупность мероприятий, охватывающих все технологические этапы разработки, выпуска и эксплуатации программного обеспечения",
    "ошибка": "ошибка\nДействие, которое порождает неправильный результат",
    "cбой": "cбой\nНесоответствие фактического результата работы компонента или системы ожидаемому результату",
    "ux": "ux\nОщущение, испытываемое пользователем во время использования цифрового продукта",
    "ui": "ui\nЭто инструмент, позволяющий осуществлять взаимодействие «пользователь — приложение»",
    "тест-дизайн": "тест-дизайн\nЭто этап процесса тестирования ПО, на котором проектируются и создаются тестовые случаи (тест кейсы)",
    "тест-план": "тест-план\nЭто документ, описывающий весь объем работ по тестированию, а также оценки рисков с вариантами их разрешения",
    "чек-лист": "чек-лист\nЭто документ, описывающий что должно быть протестировано",
    "тест-кейс": "test case\nто артефакт, описывающий совокупность шагов, конкретных условий и параметров, необходимых для проверки реализации тестируемой функции или её части",
    "регресс": "регресс\nПроверка на наличие багов, вызванных изменениями в приложении",
    ...
    ..
    .
}
