{
    "черный ящик": "черный ящик, Black box\nТестировщику не известно как устроена тестируемая система",
    "белый ящик": "белый ящик, White box\nТестировщику известно все детали реализации тестируемой системы",
    "серый ящик": "серый ящик, Grey box\nТестировщику известно только некоторые особенности устройства тестируемой системы",
    "спецификация": "спецификацияспецификация\nДетальное описание того, как должно работать ПО.",
    "приоритет багов": "приоритет баговприоритет багов\nВажность той или иной ошибки в ПО: \nTrivial — косметическая малозаметная проблема.\nMinor — очевидная, незначительная проблема.\nMajor — значительная проблема.\nCritical — проблема, нарушающая работу c ключевыми функциями ПО.\nBlocker — проблема, нарушающая функционирование ПО.",
    "баг репорт": "баг репорт\nДокумент, описывающий ситуацию или последовательность действий приведшую к некорректной работе объекта тестирования, с указанием причин и ожидаемого результата",
    "валидация": "валидация\nОпределение соответствия разрабатываемого ПО ожиданиям и потребностям пользователя, требованиям к системе",
    "верификация": "верификация\nПроцесс оценки системы или её компонентов с целью определения удовлетворяют ли результаты текущего этапа разработки условиям, сформированным в начале этого этапа",
    "тестирование": "тестирование\nПроцесс проверки соответствия заявленных к продукту требований и реально реализованной функциональности, осуществляемый путем наблюдения за его работой в искусственно созданных ситуациях и на ограниченном наборе тестов, выбранных определенным образом",
    "qa": "qa\nСовокупность мероприятий, охватывающих все технологические этапы разработки, выпуска и эксплуатации программного обеспечения",
    "ошибка": "ошибка\nДействие, которое порождает неправильный результат",
    "cбой": "cбой\nНесоответствие фактического результата работы компонента или системы ожидаемому результату",
    "ux": "ux\nОщущение, испытываемое пользователем во время использования цифрового продукта",
    "ui": "ui\nЭто инструмент, позволяющий осуществлять взаимодействие «пользователь — приложение»",
    "тест-дизайн": "тест-дизайн\nЭто этап процесса тестирования ПО, на котором проектируются и создаются тестовые случаи (тест кейсы)",
    "тест-план": "тест-план\nЭто документ, описывающий весь объем работ по тестированию, а также оценки рисков с вариантами их разрешения",
    "чек-лист": "чек-лист\nЭто документ, описывающий что должно быть протестировано",
    "тест-кейс": "test case\nто артефакт, описывающий совокупность шагов, конкретных условий и параметров, необходимых для проверки реализации тестируемой функции или её части",
    "регресс": "регресс\nПроверка на наличие багов, вызванных изменениями в приложении",
    "2pane mode": "2pane mode\n2-ух экранный режим моб.почты, который отображается в ландшафтном режиме только для планшетов",
    "app": "app\nМобильное приложение - программное обеспечение, предназначенное для работы на смартфонах, планшетах (Апп, App, Application, Приложение.)",
    "dv": "dv\nDocviewer,Просмотрщик документов, архивов.",
    "fa папка": "fa папка\nFull access, общая папка с полным доступом, ОП. Папка другого аккаунта на Я.Диске, в которой вы можете просматривать и изменять файлы",
    "filemanageractivity": "filemanageractivity\nОкно файлового менеджера, вызывается по кнопке + 'Файлы с устройства' или при попытке скачать файл на устройство",
    "getfromdisk": "getfromdisk\nОкно передачи в другое приложение из Диска, например, в Gmail письме добавить аттач ИЗ Диска",
    "l-кука": "l-кука\nПроставляется пользователям, которые пользовались логином с этого браузера за последние 10 лет",
    "ntp": "ntp\nNTP = НТП = Новая вкладка в браузере (Нажать на +)",
    "pip": "pip\nPicture in Picture Проигрывание видео в режиме 'Картинка в картинке'",
    "ptr": "ptr\nPull To Refresh, ПтР, p2r. Потянуть экран вниз для рефреша страницы",
    "puttodisk": "puttodisk\nОкно передачи ИЗ другого приложения в Диск, например, из TotalComm отправить файл В Диск",
    "ro": "ro\nRead only, общая папка только для чтения. Папка другого аккаунта, в которой вы можете только просматривать файлы",
    "startrek": "startrek\nТрекер, ST. Трекер задач, который используется и разрабатывается в Яндексе.",
    "tab bar": "tab bar\nТаббар, Нижнее меню с кнопками переключения разных срезов моб.диска",
    "tap-to-back": "tap-to-back\nВ iOS при нажатии на кнопку среза Файлы происходит переход из любой подпапки в корень Диска",
    "tap-to-pop": "tap-to-pop\nВ iOS при нажатии на любую из кнопок срезов, происходит переход в начало списка",
    "бп": "бп\nБольшая почта.Обычная почта",
    "днд": "днд\nМетод перемещения файлов путем перетаскивания (Драг-н-дроп, dnd, d-n-d, Драг-энд-дроп)",
    "кейс": "кейс\nНабор шагов, которые нужно выполнить (обычно в кейсе от 1 до 10 шагов)",
    "км": "км\nКонтекстное меню. Вызывается нажатием правой кнопки мыши",
    "ко": "ко\nКонтрольный ответ, Ответ на контрольный вопрос. Запрашивается при регистрации или восстановлении доступа к аккаунту",
    "лкм": "лкм\nЛевая кнопка мыши",
    "мб": "мб\nМенеджер браузеров. Программное обеспечение из проекта 'ПАК после интеграции'",
    "пдд": "пдд\nПочта для доменов",
    "пдд-аккаунт": "пдд-аккаунт\nАккаунты, вида «имя_пользователя@доменное_имя_владельца.ru/com...», созданные для внешних доменов. В их логине внешний домен может быть указан на кириллице или латинице",
    "пкм": "пкм\nПравая кнопка мыши",
    "попап": "попап\nPopup, всплывающее окно",
    "ПП": "ПП\nПоисковое приложение от яндекса",
    "прод": "прод\nПродакшен, Продакшн, Production\nОфициальная версия приложения (НЕ тестовая), доступная для общего пользования. При тестировании прод. версий веб-сервисов хосты прописывать не нужно. Продакшн версии мобильных приложений можно найти в App Store и Google Play",
    "пул": "пул\nPull, запрос от клиента (Диск, Почта и т.д.) на предоставление данных от сервера",
    "пуш": "пуш\nPush, запрос, инициируемый сервером, который клиент (Диск, Почта, ...) может принять или отклонить",
    "синк": "синк\nSync, синхронизация",
    "тап": "тап\nTap, Клик пальцем по экрану/кнопке/строке и т.д.",
    "тач": "тач\nTouch. Мобильная версия",
    "фаб": "фабnFAB - Floating Action Button. Плавающая кнопка, т.е. с эффектом нависания над остальной частью экрана в моб.почте: в моб.диске",
    "action bar": "action bar\nПанель действий, которая сочетает в себе заголовок и меню, упрощая навигацию и предоставляя быстрый доступ к частым операциям в моб.диске",
    "action sheet": "action sheet\nТри точки справа вверху экрана в просмотрщике моб.диска",
    "actionmod": "actionmod\nПанель действий для выбранного обьекта",
    "air drop": "air drop\nТехнология беспроводной передачи данных между apple устройствами",
    "always on top": "always on top\nТермин применяется к окнам, например, когда одно окно должно перекрывать другие окна и прочие элементы интерфейса",
    "appswitcher": "appswitcher\nПанель многозадачности (вызывается двойным нажатием на кнопку Home (ios))",
    "aviary": "aviary\nРедактор фотографий, открывается из просмотрщика моб.диска по значку квадратик с карандашиком",
    "back button": "back button\nНа Андроиде хардварная кнопка назад на телефоне",
    "body": "body\nСодержание и тело письма в почтовом ящике",
    "compose": "compose\nЭкран написания письма в Яндекс.Почте (Компоуз)",
    "contextual action bar": "contextual action bar\nCAB, Временный action bar, который фактически перекрывает постоянный топ бар приложения и пропадает после сброса выделения или применения операции.",
    "control center": "control center\nНа iOS нижняя шторка управления устройством",
    "crash": "crash\nКраш, креш, крэш. Остановка приложения в результате какой-либо ошибки (падение приложения)",
    "fast scroll на ios": "fast scroll на ios\nЭкран получаемый при нажатии на месяц на экране Фотосреза",
    "folder list": "folder list\nСписок папок, Фолдер лист. В моб.почте состоит из трех секций: свитчера (переключателя) аккаунтов, списка папок и меток, настройки",
    "folders and labels list": "folders and labels list\nСписок папок и меток. Список папок и меток",
    "mailish": "mailish\nЭто аккаунты для пользователей, определяемых внешним email-адресом",
    "phonish": "phonish\nЭто аккаунты, живущие на мобильном, связанные только с номером телефона и использующие в качестве метода авторизации смс. Живут на ограниченном количестве сервисов (Такси, Музыка, Медицина, Парковки)",
    "testflight": "testflight\nСервис, упрощающий тестирование приложений для iOS-устройств путем облегчения процесса сбора кодов тестовых устройств (UDID-ов), а также путем более легкого распространения подписанных для тестеров ",
    "ugc": "ugc\nТреки добавленные пользователем. Треки добавляются через веб-интерфейс",
    "аккаунт менеджер": "аккаунт менеджер\nАМ, Экран для регистрации/авторизации в приложении",
    "алерт": "алерт\nВсплывающее диалоговое окно",
    "алиас": "алиас\nАдрес, с которого будет отправлено письмо",
    "альбомная ориентация": "альбомная ориентация\nГоризонтальная ориентация, лэндскейп, ландшафт. Переворот девайса в горизонтальное положение (ширина экрана больше его высоты)",
    "бабл": "бабл\nПузырёк с сообщением в чате",
    "балансер": "балансер\nРаспределитель нагрузки между серверами - балансировщик нагрузки",
    "балун": "балун\nВыезжающее на экран информационное сообщение",
    "блюр": "блюр\nBlur. Под блюром обычно понимают размытие изображения/объекта, чтобы с помощью контраста резкости фона и объекта на переднем плане облегчить восприятие нужного объекта",
    "бургер": "бургер\nBurger. Меню",
    "бэдж": "бэдж\nUnread badge. Иконка непрочитанных писем на иконке приложения моб.почты",
    "вау-сетка": "вау-сетка\nРежим просмотра фотографий в разделе Фото, при котором сетка строиться в зависимости от размера фото",
    "видеопросмотрщик": "видеопросмотрщик\nСтандартное приложение, которым диск открывает видео",
    "визивиг": "визивиг\nПоле для написания и редактирования текста с возможностью применять к тексту различные стили и добавлять в текст вставки(картинки, смайлы)",
    "выпадушка": "выпадушка\nВыпадающий список, например поделяшка это та же выпадушка",
    "грид": "грид\nСтраница типа 'Таблица' на вики",
    "групповые операции": "групповые операции\nГО. Возможность работы сразу с несколькими объектами. В тач-версии почты вызывается по тапу на аватарку в списке писем, в моб.диске - по тапу на галку в топбаре",
    "двухфакторная аутентификация": "двухфакторная аутентификация\nМеханизм авторизации в Я.Почте с одноразовым паролем (2фа, 2fa)",
    "директ": "директ\nБлок с рекламой",
    "драг карты": "драг карты\nСделать любое(ые) из действий: Поскроллить карту, Позумить карту, Тапнуть на карту",
    "дропзона": "дропзона\nОбласть ДНД, куда перетаскивается файл (ДНД)",
    "желтый прыщ": "желтый прыщ\nЖелтый кружок слева от ферстлайн непрочитанного письма",
    "заглушка": "заглушка\nСтраница, показываемая вместо некоторого контента. Например, в случае, если нет сети или доступ к запрашиваемому содержимому по каким-то причинам запрещен",
    "зумировать": "зумировать\nПозумить, zoom, масштабировать. Изменить масштаб (например, карты)",
    "инбокс": "инбокс\nПапка 'Входящие' в почте",
    "инлайн-аттач": "инлайн-аттач\nАттач, вставленный в тело письма методом ДНД",
    "инлайн-реплай": "инлайн-реплай\nРазрыв цитирования в ответном письме",
    "карусель": "карусель\nАккаунт свитчер, экран выбора одного из зарегистрированных в системе аккаунтов",
    "каунтер": "каунтер\nCounter, счетчик",
    "квикреплай": "квикреплай\nСнизу просмотра письма есть поле инпута для быстрого ответа (КР)",
    "кластер в фотосрезе": "кластер в фотосрезе\nБлок фото в разделе Фото, объединенный по дате (если есть, то локации)",
    "корень диска": "корень диска\nРаздел 'Все файлы' в Я.Диске",
    "корп": "корп\nCorp, корпоративная почта",
    "ксива": "ксива\nСервер доставки пуш-уведомлений от бэкенда",
    "кукуц": "кукуц\nПри добавлении или удалении пользователя из переписки в чате рисуется серая полоса с +/- имя пользователя",
    "лайт-пользователь": "лайт-пользователь\nАккаунт, зарегистрированный с помощью уже существующего стороннего емейла.",
    "локаль": "локаль\nСистемный язык (установленный в настройках тестируемого устройства)",
    "лонгтап": "лонгтап\nДлительное нажатие",
    "мейлиши": "мейлиши\nАккаунты, которые авторизуются в приложениях Яндекса, используя логин и пароль внешнего почтового сервиса (Google, Mail, Rambler, Microsoft (Outlook))",
    "морда": "морда\nГлавная страница сайта",
    "море": "море\nКнопка открытия меню действий с письмом. Есть в свайп меню и тулбаре просмотра письма",
    "нативный": "нативный\nВстроенный, родной, идущий вместе с прошивкой. Встроенный изначально.Так, например, для андроидов < 5.x.x - это noname Android браузер, для самсунгов - samsung internet, для miui - miui браузер, для тех где всего 1 браузер (тот же хром) - он и есть нативный. На десктопе: это, например, IE и EDGE в Windows",
    "нотифайки": "нотифайки\nУведомления о новых событиях",
    "оверлей": "оверлей\nМаленькие иконки на папках в Проводнике",
    "окно шаринга": "окно шаринга\nОкно, которое появляется при нажатии кнопки шаринга (поделения)",
    "омнибокс": "омнибокс\nПоисковая строка",
    "очередь в стартреке": "очередь в стартреке\nIssue, совокупность тикетов с уникальным ключом (MAILEXP, DISKEXP), ассоциирующаяся с сервисом или каким-то видом деятельности (например: тестирование Диска асессорами)",
    "паблик": "паблик\nPublic, ПФ, Паблик файла. Страница вида - скрин. Чтобы быстро создать паблик, можно расшарить любой файл в диске. При переходе по полученной ссылке мы попадаем на паблик",
    "паранджа": "паранджа\nЗатемнение заднего фона",
    "плашка unlim-а": "плашка unlim-а\nПлашка безлимита в мобильном диске",
    "плейсходлер": "плейсходлер\nИспользуются в качестве заглушки полях и в формах ввода",
    "поделяшка": "поделяшка\nБлок/попап импорта в соцсети",
    "bcc field": "bcc field\nПоле Bcc в компоузе, поле 'Скрытая копия' на странице написания письма",
    "cc field": "cc field\nПоле Cc в компоузе. Поле 'Копия' на странице написания письма",
    "from в компоузе": "from в компоузе\nFrom field. Поле 'От кого' на странице написания письма",
    "to в компоузе": "to в компоузе\nПоле 'Кому' на странице написания письма",
    "пользователь с возможностью авторизации по соц.профилю": "пользователь с возможностью авторизации по соц.профилю\nПростой полноценный пользователь, который привязал к своему аккаунту профиль соц.сети (всего можно привязать 6 соц.сетей) и разрешил авторизацию по соц.сети",
    "портретная ориентация": "портретная ориентация\nВертикальная ориентация, Книжная ориентация. Положение девайса, когда ширина экрана меньше высоты",
    "пошарить": "пошарить\nПоделиться. Опубликовать публичную ссылку на файл, папку кнопкой шаринга",
    "превью файла": "превью файла\nУменьшенное изображение оригинала",
    "промолиба": "промолиба\nБиблиотека баннеров с рекламой яндекс-приложений. (Как правило в тестируемом приложении может встретиться баннер с рекламой промолибы)",
    "редирект": "редирект\nПеренаправление пользователя на другой адрес",
    "родительский тикет": "родительский тикет\nОсновная задача; тикет-контейнер для мелких подзадач или багов. Все баги нужно заводить подтикетами к указанному",
    "саджест": "саджест\nВыпадающее меню с вариантами значения для выбора",
    "сайдбар": "сайдбар\nВ Я.Диске меню в правой части экрана, при выделении файла в нем доступны функциональные кнопки",
    "свайп": "свайп\nСпециальный жест, движение пальцем по экрану девайса для пролистывания контента, вытягивания шторки и т.п.",
    "свайпменю": "свайпменю\nПоявляется при свайпе писем влево в моб.почте",
    "селект": "селект\nРежим селекта, активное состояние объекта в отличии от неактивного (например, при тапе по пину на карте он переходит в режим селекта)",
    "серп": "серп\nSearch Engine Results Page, морда яндекса, страница с результатами поиска",
    "скрепка": "скрепка\nИконка добавления аттачей к письму в Яндекс.Почте",
    "слайдер": "слайдер\nПревью картинок и видеофайлов с кнопками",
    "smoke": "smoke\nДымовой тест, дымовое тестирование. Минимальный набор тестов на явные ошибки. Smoke-тестирование предназначено для проверки самых простых и очевидных кейсов, без которой любой другой вид тестирования будет неоправданно излишним",
    "сниппет": "сниппет\nФрагмент текста применяемый в поисковых системах, текстовых редакторах",
    "снэк бар": "снэк бар\nУзкая панель, появляющаяся на несколько секунд внизу экрана, с краткой информацией для пользователя",
    "социальщик": "социальщик\nПользователь, зарегистрированный в Яндексе с помощью профиля из социальной сети. Это не полноценный пользователь, у него ограниченный набор прав и нету даже логина с паролем",
    "сплешскрин": "сплешскрин\nЭкран загрузки, заставка",
    "старт визард": "старт визард\nЭкран, который отображается у запущенного приложения в первый раз после добавления аккаунта (СВ)",
    "статика": "статика\nВсе статичные элементы",
    "статус-бар": "статус-бар\nМаленькая информативная панель в верхней части дисплея смартфона, где можно узнать время, заряд аккумулятора и т.д.",
    "табнейлы": "табнейлы\nМиниатюрки, которые мы видим в просмотрщике моб.диска , пока не прогрузилось превью",
    "тайтл": "тайтл\nЗаголовок чего-либо",
    "тапахед": "тапахед\n(десктоп) подсказка в виде слова, которое вы предположительно вводите/хотите ввести. Отображается в поле ввода серыми буквами после ввода первой буквы.\n(тачи) подсказка в виде слов на серых плашках, которые вы предположительно вводите/хотите ввести",
    "тестран": "тестран\nНабор кейсов, запущенный в оценку (Run)",
    "тестсьют": "тестсьют\nSuite. Набор тест кейсов, объединенных по каким-то критериям (относятся к одному тестируемому модулю, функциональности, приоритету или одному типу тестирования)",
    "тикет": "тикет\nЗадача. Определенная задача или багрепорт в сервисе Стартрек",
    "топбар": "топбар\nПанель вверху экрана приложения на которой находятся функциональные кнопки и название текущего окна приложения",
    "тост": "тост\nМаленькое окошко внизу (на Android) или вверху (на IOS) экрана с краткой информацией для пользователя, появляющееся на несколько секунд",
    "тред": "тред\nЦепочка писем с одной темой",
    "троббер": "троббер\nСпиннер. Индикатор, что программа выполняет какое-то действие, выглядит как круговая стрелка",
    "тулбар": "тулбар\nToolbar, панель групповых операций. Верхнее меню, в режиме групповых операций",
    "тултип": "тултип\nTooltip. Всплывающее окно с названием",
    "тумб": "тумб\nТумбнейл. Тумба. Миниатюра",
    "тумблер": "тумблер\nToggle, тоггл. Переключатель",
    "туториал": "туториал\nТуториал содержит презентацию и краткую информацию о продукте. Встречается при первом запуске мобильного диска",
    "тхамбы": "тхамбы\nТумбы. Миниатюрки, которые мы видим в списке в моб.диске",
    "фавиконка": "фавиконка\nЗначок веб-сайта или веб-страницы, а также изображение лого или типа файла,рядом с именем вкладки",
    "фикс": "фикс\nИсправление, поправить",
    "фотопикер": "фотопикер\nНа iOS экранчик с выбором фото и видео получаемый по нажатию на +",
    "фотопросмотрщик": "фотопросмотрщик\nСтандартное приложение, которым диск открывает фото",
    "фотосрез": "фотосрез\nРаздел 'Все фото' на мобильном диске (ФС)",
    "футер": "футер\nПодвал, footer. Нижняя часть веб-страницы с полезным содержанием (ссылками, формой обратной связи и т.д.)",
    "хедер": "хедер\nHeader, шапка. Верхняя часть веб-страницы с полезным содержанием (ссылками, строкой поиска и т.д.)",
    "ховер": "ховер\nHover. Разного рода эффекты (всплывающие подписи, подсказки, плавные переходы, трансформация, ротация, увеличение, смещение и пр.), которые наблюдаются при наведении на них курсора мыши",
    "хострут": "хострут\nНезалогиненная страница почты",
    "хоткей": "хоткей\n'Горячая' клавиша",
    "центр нотификаций": "центр нотификаций\nВерхняя шторка со списком нотификаций",
    "экран виста на android": "экран виста на android\nЭкран получаемый при нажатии на месяц на экране Фотосреза",
    "ябл": "ябл\nСформированный адрес в поле Почты",
    "янг": "янг\nСервис по сбору оценок"
}